import axios from 'axios';

const BASE_URL = 'https://pixabay.com/api/';
const KEY_API = '57464539-19ea2289c3195b6eb6e9382b1';

export function getImagesByQuery(query) {
  return axios
    .get(BASE_URL, {
      params: {
        key: KEY_API,
        q: query,
        image_type: 'photo',
        orientation: 'horizontal',
        safesearch: true,
      },
    })
    .then(response => response.data.hits)
    .catch(error => {
      console.error('Pixabay API error:', error);
      throw error;
    })
    .finally(() => {
      console.log('Request completed');
    });
}

// .then(response => {
//       console.log(response.data);
//     })
//     .catch(error => {
//       console.error(error);
//     })

// У файлі pixabay-api.js зберігай функції для виконання HTTP-запитів:
// getImagesByQuery(query). Ця функція повинна приймати один параметр query (пошукове слово, яке є рядком), здійснювати HTTP-запит і повертати значення властивості data з отриманої відповіді.
// Користувач буде вводити рядок для пошуку в текстове поле, а за сабмітом форми необхідно виконувати HTTP-запит із цим пошуковим рядком.
// При натисканні на кнопку відправки форми, додайте перевірку вмісту текстового поля на наявність порожнього рядка, щоб користувач не міг відправити запит, якщо поле пошуку порожнє.

// HTTP-запити
// Додай у проєкт бібліотеку Axios для написання коду, пов’язаного з HTTP-запитами.
// Для бекенду використовуй публічний API сервіс Pixabay. Зареєструйся, отримай свій унікальний ключ доступу і ознайомся з документацією.

// У відповіді буде об’єкт із декількома властивостями, в одному з яких (hits) буде масив об’єктів із зображеннями, що задовольнили критерії параметрів запиту.

// Обов’язково винеси функції для HTTP-запитів у файл pixabay-api.js у папці js. Це хороша практика та можливість відпрацювати модульний підхід до розробки.

// Якщо бекенд повертає порожній масив, це означає, що нічого підходящого не було знайдено. У такому випадку відображай повідомлення з текстом:

// Sorry, there are no images matching your search query. Please try again!

// Для показу повідомлень використовуй бібліотеку iziToast. Щоб підключити CSS-код бібліотеки до проєкту, необхідно додати ще один імпорт, окрім того, що описаний у документації.
